{
  "jobs": [
    {
      "id": 0,
      "company": "Robert Half",
      "title": "Full Stack Engineer II",
      "dates": "Nov 2020 - Present",
      "description": "Contributed to the development and maintenance of 20 high-traffic global websites, collaborating among 5+ different teams, while efficiently managing high-priority tickets alongside concurrent assignments, consistently delivering with efficiency and quality in a rapid agile environment. Took a leading role in a pivotal project, helping deliver 100+ high-performance web components and taking ownership of their distribution to multiple development teams. Served as an invaluable right-hand to the architect and senior developer, ensuring swift issue resolution for critical challenges. Mentored and guided fellow team members, conducting multiple code reviews simultaneously, and consistently extended support and assistance to colleagues in need.",
      "skills": [
        "Javascript",
        "React",
        "Stencil",
        "Storybook",
        "AEM",
        "Drupal",
        "Java",
        "PHP"
      ],
      "url": "https://roberthalf.com/"
    },
    {
      "id": 1,
      "company": "Boonoob",
      "title": "Full Stack Engineer",
      "dates": "Jun - Nov 2020",
      "description": "Designed and implemented multiple RESTful web API endpoints in Node to proficiently manage a variety of HTTP requests. Simultaneously collaborated with the production team to conceptualize and execute user-friendly features, resulting in a significant boost in user engagement and acquisition.",
      "skills": [
        "Javascript",
        "Node",
        "Express",
        "Stripe",
        "MongoDB",
        "Postman",
        "UX/UI Design"
      ],
      "url": "https://boonoob.com/"
    },
    {
      "id": 2,
      "company": "Fanmire",
      "title": "Full Stack Engineer",
      "dates": "Jun - May 2020",
      "description": "Engineered a website showcasing a social media aggregation system, collecting user content from Twitter, Facebook, and Instagram, and presenting it in an elegant newsfeed. Took initiative on the design, development of the user interface, and server including database collection.",
      "skills": [
        "Javascript",
        "Node",
        "Vue",
        "Express",
        "Axios",
        "MongoDB",
        "Postman",
        "UX/UI Design"
      ],
      "url": "https://fanmire.com/"
    },
    {
      "id": 3,
      "company": "Thinq.tv",
      "title": "Frontend Engineer Intern",
      "dates": "May - Aug 2019",
      "description": "Collaborated with the frontend team to craft an elegant and user-centric interface, delivered code for the site, while also actively contributing to enhancing the backend website's performance in close coordination with the entire development team.",
      "skills": ["Javascript", "HTML/CSS", "Ruby", "Heroku", "UX/UI Design"],
      "url": "https://www.linkedin.com/company/thinqtv/"
    }
  ]
}
