{
  "jobs": [
    {
      "id": 0,
      "company": "Robert Half",
      "title": "Full Stack Engineer II",
      "dates": "Nov 2020 - Present",
      "description": "Collaborated closely in the construction and maintenance of 20 global websites that generate millions of traffic, fostering synergy among 5+ different teams. Improved customer experience by consistently launching 5-10 new features and fixes to current issues every two weeks in a rapid agile environment. Took a leading role in a new and critical project, delivering over 100 high-performance web components and taking ownership of their distribution through bi-weekly releases to multiple development teams. Proficiently managed high-priority tickets in tandem with concurrent assignments, consistently delivering efficient and top-quality solutions. Served as an indispensable right-hand to the architect and senior developer, ensuring swift and effective responses to intricate challenges. Mentored and guided fellow team members, conducting multiple code reviews simultaneously, and consistently extended support and assistance to colleagues in need.",
      "skills": [
        "Javascript",
        "React",
        "Stencil",
        "Storybook",
        "AEM",
        "Drupal",
        "Java",
        "PHP",
        "Fullstack"
      ],
      "url": "https://roberthalf.com/"
    },
    {
      "id": 1,
      "company": "Boonoob",
      "title": "Full Stack Engineer",
      "dates": "Jun - Nov 2020",
      "description": "Designed and implemented a comprehensive suite of RESTful web API endpoints in Node to proficiently manage a variety of HTTP requests. Simultaneously collaborated with the production team to conceptualize and execute user-friendly features, resulting in a significant boost in user engagement and acquisition.",
      "skills": [
        "Javascript",
        "Node",
        "Express",
        "Stripe",
        "MongoDB",
        "Postman",
        "Backend"
      ],
      "url": "https://boonoob.com/"
    },
    {
      "id": 2,
      "company": "Fanmire",
      "title": "Full Stack Engineer",
      "dates": "Jun - May 2020",
      "description": "Engineered a website showcasing a social media aggregation system, collecting user content from Twitter, Facebook, and Instagram, and presenting it in an elegant newsfeed. Took initiative on the design, development of the user interface, and server including database collection.",
      "skills": [
        "Javascript",
        "Node",
        "Vue",
        "Express",
        "Axios",
        "MongoDB",
        "Postman",
        "Fullstack",
        "UX/UI Design"
      ],
      "url": "https://fanmire.com/"
    },
    {
      "id": 3,
      "company": "Thinq.tv",
      "title": "Frontend Engineer Intern",
      "dates": "May - Aug 2019",
      "description": "Collaborated with the frontend team to craft an elegant and user-centric interface, delivered code for the site, while also actively contributing to enhancing the backend website's performance in close coordination with the entire development team.",
      "skills": [
        "Javascript",
        "HTML/CSS",
        "Ruby",
        "Heroku",
        "Frontend",
        "UX/UI Design"
      ],
      "url": "https://www.thinq.tv/"
    }
  ]
}
