{
  "jobs": [
    {
      "id": 0,
      "company": "Robert Half",
      "name": "robert_half",
      "title": "Full Stack Engineer II",
      "dates": "November 2020 - Present",
      "description": "Contributing to replatforming and maintaining 20 global websites, resulting in a 25% increase in user engagement in the first 4 months of launch via collaboration with 5+ cross-functional teams. Expertly building a pivotal component library containing 100+ high-performance web components with 250+ variants and taking ownership of its release process. Minimizing production bugs and resolving bottlenecks by leading the research and implementation of processes to improve development and testing cycles. Fostering a collaborative and empowered team workspace by mentoring fellow team members, conducting simultaneous code reviews, and regularly offering support wherever needed.",
      "skills": [
        "Javascript",
        "React",
        "Stencil",
        "Storybook",
        "Chromatic",
        "Adobe AEM",
        "Drupal",
        "PHP"
      ],
      "url": "https://roberthalf.com/"
    },
    {
      "id": 1,
      "company": "Buzzable",
      "name": "boonoob",
      "title": "Full Stack Engineer",
      "dates": "June - November 2020",
      "description": "Conceptualized and executed user-friendly features, resulting in a 20% boost in user acquisition through collaboration with the business and production teams. Orchestrated the design and implementation of foundational REST API endpoints asynchronously in Node, instrumental in the company's early stages and gaining initial users.",
      "skills": [
        "Javascript",
        "React",
        "Node",
        "REST",
        "Express",
        "Stripe",
        "MongoDB",
        "Postman"
      ],
      "url": "https://boonoob.com/"
    },
    {
      "id": 2,
      "company": "Fanmire",
      "name": "fanmire",
      "title": "Full Stack Engineer",
      "dates": "January - May 2020",
      "description": "Led the design and engineering of a web app aggregating social media content from Twitter, Facebook, and Instagram APIs into a dynamic, unified newsfeed, satisfying business requests.",
      "skills": [
        "Javascript",
        "Vue",
        "Node",
        "REST",
        "Express",
        "Axios",
        "MongoDB",
        "Postman"
      ],
      "url": "https://fanmire.com/"
    },
    {
      "id": 3,
      "company": "Thinq.tv",
      "name": "thinq_tv",
      "title": "Frontend Engineer Intern",
      "dates": "May - August 2019",
      "description": "Developed prominent features on the website's front page to capture user engagement while proactively looking for other opportunities to help, such as enhancing the website's performance.",
      "skills": ["Javascript", "HTML/CSS", "Heroku"],
      "url": "https://www.linkedin.com/company/thinqtv/"
    }
  ]
}
