{
  "jobs": [
    {
      "id": 0,
      "company": "Robert Half",
      "title": "Full Stack Engineer II",
      "dates": "Nov 2020 - Present",
      "description": "Contributed to the development and maintenance of 20 global websites achieving a daily average of 500k user visits, collaborated among 5+ different teams via continuous and effective communication, and efficiently handled high-priority tasks in a rapid agile environment. Took a leading role in a pivotal Component Library and total website renovation project delivering 100+ high-performance web components with 250+ variants, allied with the UX, design, and business teams, and seized ownership of its release process and distribution. Expedited significant challenges such as troubleshooting, handling urgent issues, triaging reported bugs, and discussing ideas, voluntarily alleviating daily duties of the Senior Solutions Architect. Mentored fellow team members, conducted simultaneous code reviews, and regularly offered support wherever needed, fostering a collaborative and empowered team workspace.",
      "skills": [
        "Javascript",
        "React",
        "Stencil",
        "Storybook",
        "Chromatic",
        "AEM",
        "Drupal",
        "PHP"
      ],
      "url": "https://roberthalf.com/"
    },
    {
      "id": 1,
      "company": "Boonoob",
      "title": "Full Stack Engineer",
      "dates": "Jun - Nov 2020",
      "description": "Orchestrated the design and implementation of foundational REST API endpoints asynchronously in Node, instrumental in the company's early stages and gaining initial users. Simultaneously collaborated with the production and business teams to conceptualize and execute user-friendly features, resulting in a significant 20% boost in user acquisition.",
      "skills": [
        "Javascript",
        "React",
        "Node",
        "REST",
        "Express",
        "Stripe",
        "MongoDB",
        "Postman"
      ],
      "url": "https://boonoob.com/"
    },
    {
      "id": 2,
      "company": "Fanmire",
      "title": "Full Stack Engineer",
      "dates": "Jan - May 2020",
      "description": "Led the design and engineering of a web app aggregating social media content from Twitter, Facebook, and Instagram APIs into a dynamic and unified newsfeed, satisfying business requests.",
      "skills": [
        "Javascript",
        "Vue",
        "Node",
        "REST",
        "Express",
        "Axios",
        "MongoDB",
        "Postman"
      ],
      "url": "https://fanmire.com/"
    },
    {
      "id": 3,
      "company": "Thinq.tv",
      "title": "Frontend Engineer Intern",
      "dates": "May - Aug 2019",
      "description": "Developed prominent features on the front page of the website to capture user engagement and visibility while proactively looking for other opportunities to help such as enhancing the website's performance.",
      "skills": ["Javascript", "HTML/CSS", "Heroku"],
      "url": "https://www.linkedin.com/company/thinqtv/"
    }
  ]
}
