{
  "jobs": [
    {
      "id": 0,
      "company": "Robert Half",
      "title": "Full Stack Engineer II",
      "dates": "Nov 2020 - Present",
      "description": "Contributed to the development and maintenance of 20 high-traffic global websites, collaborated among 5+ different teams, skillfully managed high-priority tickets alongside concurrent assignments, and consistently delivered with quality and efficiency in a rapid agile environment. Took a leading role in a pivotal Component Library project, helped deliver 100+ high-performance web components while working closely with the design team, and took ownership of its release process and distribution to multiple development teams. Served as direct support to the Senior Solutions Architect and swiftly expedited significant challenges, including troubleshooting, handling urgent issues, triaging reported bugs, and discussing implementation ideas. Mentored and guided fellow team members, conducted multiple code reviews simultaneously, and regularly offered support wherever needed.",
      "skills": [
        "Javascript",
        "React",
        "Stencil",
        "Storybook",
        "AEM",
        "Drupal",
        "PHP"
      ],
      "url": "https://roberthalf.com/"
    },
    {
      "id": 1,
      "company": "Boonoob",
      "title": "Full Stack Engineer",
      "dates": "Jun - Nov 2020",
      "description": "Designed and implemented multiple RESTful web API endpoints in Node to proficiently manage a variety of HTTP requests asynchronously. Simultaneously collaborated with the production team to conceptualize and execute user-friendly features, resulting in a significant boost in user engagement and acquisition.",
      "skills": [
        "Javascript",
        "Node",
        "Express",
        "Stripe",
        "MongoDB",
        "Postman",
        "UX/UI Design"
      ],
      "url": "https://boonoob.com/"
    },
    {
      "id": 2,
      "company": "Fanmire",
      "title": "Full Stack Engineer",
      "dates": "Jan - May 2020",
      "description": " Engineered a website showcasing a social media aggregation system, collecting user content from Twitter, Facebook, and Instagram, and presenting it in a clean and unified newsfeed. Took charge of the design and development of the user interface, server, and database collection.",
      "skills": [
        "Javascript",
        "Node",
        "Vue",
        "Express",
        "Axios",
        "MongoDB",
        "Postman",
        "UX/UI Design"
      ],
      "url": "https://fanmire.com/"
    },
    {
      "id": 3,
      "company": "Thinq.tv",
      "title": "Frontend Engineer Intern",
      "dates": "May - Aug 2019",
      "description": "Collaborated with the frontend team to craft an elegant and user-centric interface and delivered code for the site, while also actively contributing to enhancing the backend website's performance in close coordination with the entire development team.",
      "skills": ["Javascript", "HTML/CSS", "Heroku", "UX/UI Design"],
      "url": "https://www.linkedin.com/company/thinqtv/"
    }
  ]
}
